Microsoft Windows [Version 10.0.19042.746]
(c) 2020 Microsoft Corporation. All rights reserved.

C:\Users\bryan>code --list-extensions
2gua.rainbow-brackets
aaron-bond.better-comments
abusaidm.html-snippets
adpyke.codesnap
AhadCove.js-quick-console
akamud.vscode-javascript-snippet-pack
alexbabichev.formatter-pug
alexcvzz.vscode-sqlite
algor.monokaiplus
almenon.arepl
amandeepmittal.pug
AnchovyStudios.zip-extract-all
austin.code-gnu-global
bajdzis.vscode-database
be5invis.toml
bencoleman.armview
bengreenier.vscode-node-readme
benjpas.close-all
bierner.docs-view
bierner.emojisense
bierner.gif-player
bierner.lit-html
bierner.markdown-emoji
bmewburn.vscode-intelephense-client
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradymholt.pgformatter
brapifra.phpserver
brunnerh.insert-unicode
buianhthang.xml2json
burkeholland.simple-react-snippets
canna.box-comment
caolin.java-run
capaj.vscode-standardjs-snippets
chenxsan.vscode-standardjs
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
ckolkman.vscode-postgres
codespaces-contrib.codeswing
codezombiech.gitignore
Compulim.vscode-azure-storage-utility
cschlosser.doxdocgen
cweijan.vscode-mysql-client2
cweijan.vscode-office
dabai.react-template
daylerees.rainglow
dbaeumer.vscode-eslint
dcasella.monokai-plusplus
discountry.react-redux-react-router-snippets
docsmsft.docs-markdown
donjayamanne.javadebugger
donjayamanne.jquerysnippets
donjayamanne.python-extension-pack
DotJoshJohnson.xml
DSnake.java-debug
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.vscode-npm-script
electrotype.windows-explorer-context-menu
emmanuelbeziat.vscode-great-icons
equinusocio.vsc-material-theme-icons
evileumas.html-to-javascript-string
fabiospampinato.vscode-open-in-application
fcrespo82.markdown-table-formatter
felixfbecker.php-debug
felixfbecker.php-pack
file-icons.file-icons
fknop.vscode-npm
formulahendry.auto-close-tag
formulahendry.azure-storage-explorer
formulahendry.code-runner
frenco.vscode-vercel
frhtylcn.pythonsnippets
GitHub.vscode-pull-request-github
gogocrow.webpack-snippets
Gruntfuggly.activitusbar
hars.CppSnippets
hediet.debug-visualizer
hediet.vscode-drawio
heflyaway.turbo-js
HookyQR.beautify
howardzuo.vscode-favorites
humao.rest-client
IBM.output-colorizer
inu1255.easy-snippet
iocave.monkey-patch
ionutvmi.path-autocomplete
jakob101.RelativePath
jamespgilbert.comment-labels
jasonnutter.search-node-modules
jaszhix.theme-monokaiMega
jebbs.markdown-extended
jeff-hykin.better-cpp-syntax
jerrygoyal.shortcut-menu-bar
jkjustjoshing.vscode-text-pastry
joffreykern.markdown-toc
jsayol.firebase-explorer
jundat95.react-native-snippet
junstyle.php-cs-fixer
k9982874.github-gist-explorer
kenhowardpdx.vscode-gist
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
KnisterPeter.vscode-github
lacroixdavid1.vscode-format-context-menu
learn-game-development.js-syntax-extension
LeetCode.vscode-leetcode
leizongmin.node-module-intellisense
leodriesch.paste-html-as-jsx
LevitatingBusinessMan.hyper-vsc
magicstack.MagicPython
MariusAlchimavicius.json-to-ts
mdickin.markdown-shortcuts
mervin.markdown-formatter
mgesbert.python-path
mgmcdermott.vscode-language-babel
mikeburgh.xml-format
mrmlnc.vscode-scss
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-apimanagement
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-dotnettools.dotnet-interactive-vscode
ms-dotnettools.vscode-dotnet-runtime
ms-ossdata.vscode-postgresql
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vscode.azurecli
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
ms-vscode.vscode-node-azure-pack
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsonline.vsonline
msazurermtools.azurerm-vscode-tools
msjsdiag.debugger-for-chrome
msjsdiag.debugger-for-edge
msjsdiag.vscode-react-native
mtxr.sqltools
mushan.vscode-paste-image
mutantdino.resourcemonitor
naumovs.color-highlight
naumovs.theme-oceanicnext
neilbrayfield.php-docblocker
nemesv.copy-file-name
nhoizey.gremlins
nick-rudenko.back-n-forth
nicoespeon.abracadabra
NikolaosGeorgiou.html-fmt-vscode
njLeonZhang.markdown-image-paste
njpwerner.autodocstring
NuclleaR.vscode-extension-auto-import
oderwat.indent-rainbow
onesdev.vscode-paste-image-plus
pavan.VSNotebooks
pdconsec.vscode-print
Perkovec.emoji
Perkovec.require-sort
pflannery.vscode-versionlens
PKief.material-icon-theme
pmneo.tsimporter
purocean.drawio-preview
RandomFractalsInc.vscode-data-preview
rebornix.ruby
redhat.java
redhat.vscode-yaml
RedVanWorkshop.explorer-exclude-vscode-extension
riazxrazor.html-to-jsx
rifi2k.format-html-in-php
ritwickdey.LiveServer
rocketseat.rocketseatreactjs
sallar.json-to-js-object
sburg.vscode-javascript-booster
schroeter.prettier-vscode-space-parenthesis
shailen.netlify
Shan.code-settings-sync
shd101wyy.markdown-preview-enhanced
shengchen.vscode-checkstyle
skyran.js-jsx-snippets
slevesque.vscode-multiclip
SlySherZ.comment-box
sporiley.css-auto-prefix
stackbreak.comment-divider
steoates.autoimport
stormwarning.json-template
stuart.unique-window-colors
TabNine.tabnine-vscode
tchayen.markdown-links
techer.open-in-browser
telesoho.vscode-markdown-paste-image
tgreen7.vs-code-node-require
thekalinga.bootstrap4-vscode
tomoki1207.pdf
usernamehw.remove-empty-lines
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-pack
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
WakaTime.vscode-wakatime
WallabyJs.quokka-vscode
WallabyJs.wallaby-vscode
WASTeamAccount.WebTemplateStudio-dev-nightly
whtouche.vscode-js-console-utils
wingrunr21.vscode-ruby
Wscats.eno
Wscats.qf
xabikos.JavaScriptSnippets
xabikos.ReactSnippets
yatki.vscode-surround
yzane.markdown-pdf
yzhang.markdown-all-in-one
zfzackfrost.commentbars
zhangrenyang.vscode-plugin-remove-js-comments
Zignd.html-css-class-completion